Repository: AhmedMazenNn/Smart_Shopping
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tr, ur

source: المستخدم
tr: Kullanıcı
ur: صارف

source: إجمالي السلة
tr: Sepet Toplamı
ur: کارٹ کا کل

source: N/A
tr: Yok
ur: دستیاب نہیں

source: العميل
tr: Müşteri
ur: گاہک

source: Order
tr: Sipariş
ur: آرڈر

source: Invoice
tr: Fatura
ur: انوائس

source: Related Order/Invoice
tr: İlgili Sipariş/Fatura
ur: متعلقہ آرڈر/انوائس

source: User Account
tr: Kullanıcı Hesabı
ur: صارف کا اکاؤنٹ

source: Phone Number
tr: Telefon Numarası
ur: فون نمبر

source: Customer
tr: Müşteri
ur: گاہک

source: Customers
tr: Müşteriler
ur: گاہک

source: Session Key
tr: Oturum Anahtarı
ur: سیشن کلید

source: Created At
tr: Oluşturulma Tarihi
ur: بنانے کی تاریخ

source: Last Updated At
tr: Son Güncelleme Tarihi
ur: آخری بار اپ ڈیٹ کیا گیا

source: Is Active
tr: Aktif mi
ur: فعال ہے

source: Customer Cart
tr: Müşteri Sepeti
ur: گاہک کا کارٹ

source: Customer Carts
tr: Müşteri Sepetleri
ur: گاہک کے کارٹ

source: Guest
tr: Misafir
ur: مہمان

source: Cart
tr: Sepet
ur: کارٹ

source: Product
tr: Ürün
ur: پروڈکٹ

source: Quantity
tr: Miktar
ur: مقدار

source: Added At
tr: Ekleme Tarihi
ur: شامل کرنے کی تاریخ

source: Customer Cart Item
tr: Müşteri Sepet Öğesi
ur: گاہک کا کارٹ آئٹم

source: Customer Cart Items
tr: Müşteri Sepet Öğeleri
ur: گاہک کے کارٹ آئٹم

source: in Cart
tr: Sepette
ur: کارٹ میں

source: Reviewing Customer
tr: İnceleyen Müşteri
ur: گاہک کا جائزہ لے رہا ہے

source: Cashier Rating (1-5)
tr: Kasiyer Puanı (1-5)
ur: کیشیئر کی ریٹنگ (1-5)

source: Branch Rating (1-5)
tr: Şube Puanı (1-5)
ur: برانچ کی ریٹنگ (1-5)

source: App Rating (1-5)
tr: Uygulama Puanı (1-5)
ur: ایپ کی ریٹنگ (1-5)

source: Additional Comments
tr: Ek Yorumlar
ur: اضافی تبصرے

source: Submitted At
tr: Gönderilme Tarihi
ur: جمع کرانے کی تاریخ

source: Rating
tr: Puan
ur: ریٹنگ

source: Ratings
tr: Puanlar
ur: ریٹنگز

source: No Order
tr: Sipariş Yok
ur: کوئی آرڈر نہیں

source: Rating for
tr: İçin Puan
ur: کے لیے ریٹنگ

source: by
tr: tarafından
ur: بذریعہ

source: Direct creation of ratings is not allowed. Ratings are created automatically for invoices. Please update an existing rating.
tr: Doğrudan puan oluşturmaya izin verilmez. Puanlar faturalar için otomatik olarak oluşturulur. Lütfen mevcut bir puanı güncelleyin.
ur: ریٹنگز براہ راست بنانا جائز نہیں۔ ریٹنگز انوائسز کے لیے خود بخود بن جاتی ہیں۔ براہ کرم موجودہ ریٹنگ کو اپ ڈیٹ کریں۔

source: You do not have permission to update this rating.
tr: Bu puanı güncelleme izniniz yok.
ur: آپ کو اس ریٹنگ کو اپ ڈیٹ کرنے کی اجازت نہیں ہے۔

source: You do not have permission to delete ratings.
tr: Puanları silme izniniz yok.
ur: آپ کو ریٹنگز کو حذف کرنے کی اجازت نہیں ہے۔

source: Timestamps
tr: Zaman Damgaları
ur: ٹائم سٹیمپس

source: Message Preview
tr: Mesaj Önizlemesi
ur: پیغام کا پیش نظارہ

source: Configuration Name
tr: Yapılandırma Adı
ur: کنفیگریشن کا نام

source: Description
tr: Açıklama
ur: تفصیل

source: API Base URL
tr: API Temel URL'si
ur: API بیس URL

source: API Key (or Token)
tr: API Anahtarı (veya Token)
ur: API کلید (یا ٹوکن)

source: Is Active Configuration
tr: Aktif Yapılandırma mı
ur: فعال کنفیگریشن ہے

source: Accounting/Integration System Type
tr: Muhasebe/Entegrasyon Sistemi Türü
ur: اکاؤنٹنگ/انٹیگریشن سسٹم کی قسم

source: Last Synced At
tr: Son Senkronizasyon Tarihi
ur: آخری بار مطابقت پذیر کیا گیا

source: Updated At
tr: Güncelleme Tarihi
ur: اپ ڈیٹ کرنے کی تاریخ

source: Accounting System Configuration
tr: Muhasebe Sistemi Yapılandırması
ur: اکاؤنٹنگ سسٹم کنفیگریشن

source: Accounting System Configurations
tr: Muhasebe Sistemi Yapılandırmaları
ur: اکاؤنٹنگ سسٹم کنفیگریشنز

source: Sync Date
tr: Senkronizasyon Tarihi
ur: مطابقت پذیری کی تاریخ

source: Pending
tr: Beklemede
ur: زیر التواء

source: Success
tr: Başarılı
ur: کامیابی

source: Failed
tr: Başarısız
ur: ناکامی

source: In Progress
tr: Devam Ediyor
ur: جاری ہے

source: Sync Status
tr: Senkronizasyon Durumu
ur: مطابقت پذیری کی حیثیت

source: Sync Message
tr: Senkronizasyon Mesajı
ur: مطابقت پذیری کا پیغام

source: Products Synced
tr: Senkronize Edilen Ürünler
ur: پروڈکٹس مطابقت پذیر ہوئے

source: Errors Count
tr: Hata Sayısı
ur: غلطیوں کی تعداد

source: Product Sync Log
tr: Ürün Senkronizasyon Kaydı
ur: پروڈکٹ مطابقت پذیری لاگ

source: Product Sync Logs
tr: Ürün Senkronizasyon Kayıtları
ur: پروڈکٹ مطابقت پذیری لاگز

source: Related Order
tr: İlgili Sipariş
ur: متعلقہ آرڈر

source: Retried
tr: Tekrar Denendi
ur: دوبارہ کوشش کی گئی

source: Accounting System Invoice ID
tr: Muhasebe Sistemi Fatura Kimliği
ur: اکاؤنٹنگ سسٹم انوائس ID

source: App Commission Rate (%)
tr: Uygulama Komisyon Oranı (%)
ur: ایپ کمیشن کی شرح (%)

source: Total Amount Before Commission
tr: Komisyondan Önceki Toplam Tutar
ur: کمیشن سے پہلے کل رقم

source: Amount Sent to Accounting
tr: Muhasebeye Gönderilen Tutar
ur: اکاؤنٹنگ کو بھیجی گئی رقم

source: Sale Invoice Sync Log
tr: Satış Faturası Senkronizasyon Kaydı
ur: سیل انوائس مطابقت پذیری لاگ

source: Sale Invoice Sync Logs
tr: Satış Faturası Senkronizasyon Kayıtları
ur: سیل انوائس مطابقت پذیری لاگز

source: ZATCA UUID
ur: زاتکا UUID

source: Invoice Hash
tr: Fatura Hash'i
ur: انوائس ہیش

source: Cryptographic Stamp
tr: Kriptografik Damga
ur: کرپٹوگرافک سٹیمپ

source: QR Code Data (Base64)
tr: QR Kod Verisi (Base64)
ur: QR کوڈ ڈیٹا (Base64)

source: Fatoora XML Content
tr: Fatoora XML İçeriği
ur: فاتورہ XML مواد

source: Last ZATCA API Response
tr: Son ZATCA API Yanıtı
ur: آخری زاتکا API جواب

source: Last ZATCA Submission Date
tr: Son ZATCA Gönderme Tarihi
ur: آخری زاتکا جمع کرانے کی تاریخ

source: Pending Processing
tr: İşlem Beklemede
ur: زیر التواء پروسیسنگ

source: Accepted by ZATCA
tr: ZATCA Tarafından Kabul Edildi
ur: زاتکا نے قبول کیا

source: Rejected by ZATCA
tr: ZATCA Tarafından Reddedildi
ur: زاتکا نے مسترد کیا

source: Reported (Phase 1)
tr: Raporlandı (Faz 1)
ur: رپورٹ کیا گیا (مرحلہ 1)

source: Cleared (Phase 2)
tr: Temizlendi (Faz 2)
ur: صاف کیا گیا (مرحلہ 2)

source: Failed ZATCA Validation
tr: ZATCA Doğrulaması Başarısız
ur: زاتکا کی توثیق ناکام

source: Unknown Status
tr: Bilinmeyen Durum
ur: نامعلوم حیثیت

source: ZATCA Processing Status
tr: ZATCA İşlem Durumu
ur: زاتکا پروسیسنگ کی حیثیت

source: ZATCA Error Message
tr: ZATCA Hata Mesajı
ur: زاتکا خرابی کا پیغام

source: ZATCA E-Invoice Detail
tr: ZATCA E-Fatura Detayı
ur: زاتکا ای-انوائس تفصیل

source: ZATCA E-Invoice Details
tr: ZATCA E-Fatura Detayları
ur: زاتکا ای-انوائس تفصیلات

source: Application commission rate applied to this sale.
tr: Bu satışa uygulanan uygulama komisyon oranı.
ur: اس فروخت پر لاگو ہونے والی ایپلیکیشن کمیشن کی شرح۔

source: Total amount of sale before applying application commission.
tr: Uygulama komisyonu uygulanmadan önceki toplam satış tutarı.
ur: ایپلیکیشن کمیشن لاگو کرنے سے پہلے فروخت کی کل رقم۔

source: Final amount sent to accounting system after commission.
tr: Komisyondan sonra muhasebe sistemine gönderilen nihai tutar.
ur: کمیشن کے بعد اکاؤنٹنگ سسٹم کو بھیجی گئی حتمی رقم۔

source: Error: Accounting system configuration not found or not active.
tr: Hata: Muhasebe sistemi yapılandırması bulunamadı veya aktif değil.
ur: خرابی: اکاؤنٹنگ سسٹم کنفیگریشن نہیں ملی یا فعال نہیں ہے۔

source: Attempting to send invoice to accounting system via background task.
tr: Faturayı arka plan göreviyle muhasebe sistemine göndermeye çalışılıyor.
ur: پس منظر ٹاسک کے ذریعے اکاؤنٹنگ سسٹم کو انوائس بھیجنے کی کوشش کر رہا ہے۔

source: Re-attempting to send invoice to accounting system via background task.
tr: Faturayı arka plan göreviyle muhasebe sistemine yeniden göndermeye çalışılıyor.
ur: پس منظر ٹاسک کے ذریعے اکاؤنٹنگ سسٹم کو انوائس دوبارہ بھیجنے کی کوشش کر رہا ہے۔

source: Invoice sent successfully via background task.
tr: Fatura arka plan göreviyle başarıyla gönderildi.
ur: پس منظر ٹاسک کے ذریعے انوائس کامیابی سے بھیج دی گئی۔

source: Failed to send invoice to accounting system via background task:
tr: Faturayı arka plan göreviyle muhasebe sistemine gönderme başarısız:
ur: پس منظر ٹاسک کے ذریعے اکاؤنٹنگ سسٹم کو انوائس بھیجنے میں ناکام:

source: An unexpected error occurred during invoice sync background task:
tr: Fatura senkronizasyon arka plan görevi sırasında beklenmeyen bir hata oluştu:
ur: انوائس مطابقت پذیری کے پس منظر ٹاسک کے دوران ایک غیر متوقع خرابی پیش آئی:

source: Starting scheduled product sync from accounting system.
tr: Muhasebe sisteminden planlanmış ürün senkronizasyonu başlatılıyor.
ur: اکاؤنٹنگ سسٹم سے شیڈولڈ پروڈکٹ مطابقت پذیری شروع ہو رہی ہے۔

source: No default branch found to assign products.
tr: Ürünleri atamak için varsayılan şube bulunamadı.
ur: پروڈکٹس تفویض کرنے کے لیے کوئی ڈیفالٹ برانچ نہیں ملی۔

source: Unnamed Product
tr: Adlandırılmamış Ürün
ur: بے نام پروڈکٹ

source: Failed to sync products from accounting system:
tr: Ürünleri muhasebe sisteminden senkronize etme başarısız:
ur: اکاؤنٹنگ سسٹم سے پروڈکٹس مطابقت پذیر کرنے میں ناکام:

source: An unexpected error occurred during product sync:
tr: Ürün senkronizasyonu sırasında beklenmeyen bir hata oluştu:
ur: پروڈکٹ مطابقت پذیری کے دوران ایک غیر متوقع خرابی پیش آئی:

source: Order not found.
tr: Sipariş bulunamadı.
ur: آرڈر نہیں ملا۔

source: Accounting system configuration not found or not active.
tr: Muhasebe sistemi yapılandırması bulunamadı veya aktif değil.
ur: اکاؤنٹنگ سسٹم کنفیگریشن نہیں ملی یا فعال نہیں ہے۔

source: Attempting to send invoice to accounting system.
tr: Faturayı muhasebe sistemine göndermeye çalışılıyor.
ur: اکاؤنٹنگ سسٹم کو انوائس بھیجنے کی کوشش کر رہا ہے۔

source: Invoice sent successfully.
tr: Fatura başarıyla gönderildi.
ur: انوائس کامیابی سے بھیج دی گئی۔

source: Invoice sent to accounting system successfully.
tr: Fatura muhasebe sistemine başarıyla gönderildi.
ur: اکاؤنٹنگ سسٹم کو انوائس کامیابی سے بھیج دی گئی۔

source: Failed to send invoice to accounting system:
tr: Faturayı muhasebe sistemine gönderme başarısız:
ur: اکاؤنٹنگ سسٹم کو انوائس بھیجنے میں ناکام:

source: An unexpected error occurred during invoice sync:
tr: Fatura senkronizasyonu sırasında beklenmeyen bir hata oluştu:
ur: انوائس مطابقت پذیری کے دوران ایک غیر متوقع خرابی پیش آئی:

source: Messages
tr: Mesajlar
ur: پیغامات

source: Site Maps
tr: Site Haritaları
ur: سائٹ میپس

source: Static Files
tr: Statik Dosyalar
ur: سٹیٹک فائلز

source: Syndication
tr: Sendikasyon
ur: سنڈیکیشن

source: That page number is not an integer
tr: Bu sayfa numarası bir tam sayı değil
ur: وہ صفحہ نمبر ایک صحیح عدد نہیں ہے۔

source: That page number is less than 1
tr: Bu sayfa numarası 1'den küçük
ur: وہ صفحہ نمبر 1 سے کم ہے۔

source: That page contains no results
tr: Bu sayfa hiç sonuç içermiyor
ur: اس صفحے میں کوئی نتیجہ نہیں ہے۔

source: Enter a valid value.
tr: Geçerli bir değer girin.
ur: ایک درست قدر درج کریں۔

source: Enter a valid domain name.
tr: Geçerli bir alan adı girin.
ur: ایک درست ڈومین نام درج کریں۔

source: Enter a valid URL.
tr: Geçerli bir URL girin.
ur: ایک درست URL درج کریں۔

source: Enter a valid integer.
tr: Geçerli bir tam sayı girin.
ur: ایک درست صحیح عدد درج کریں۔

source: Enter a valid email address.
tr: Geçerli bir e-posta adresi girin.
ur: ایک درست ای میل ایڈریس درج کریں۔

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
tr: Harflerden, rakamlardan, alt çizgilerden veya kısa çizgilerden oluşan geçerli bir “slug” girin.
ur: ایک درست “slug” درج کریں جو حروف، اعداد، انڈرسکور یا ہائفن پر مشتمل ہو۔

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
tr: Unicode harflerden, rakamlardan, alt çizgilerden veya kısa çizgilerden oluşan geçerli bir “slug” girin.
ur: ایک درست “slug” درج کریں جو یونیکوڈ حروف، اعداد، انڈرسکور، یا ہائفن پر مشتمل ہو۔

source: Enter a valid %(protocol)s address.
tr: Geçerli bir %(protocol)s adresi girin.
ur: ایک درست %(protocol)s ایڈریس درج کریں۔

source: IPv4 or IPv6
tr: IPv4 veya IPv6
ur: IPv4 یا IPv6

source: Enter only digits separated by commas.
tr: Yalnızca virgüllerle ayrılmış rakamlar girin.
ur: صرف کوما سے جدا شدہ اعداد درج کریں۔

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
tr: Bu değerin %(limit_value)s olduğundan emin olun (mevcut değer %(show_value)s).
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s ہے (یہ %(show_value)s ہے)۔

source: Ensure this value is less than or equal to %(limit_value)s.
tr: Bu değerin %(limit_value)s'den küçük veya eşit olduğundan emin olun.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s سے کم یا اس کے برابر ہے۔

source: Ensure this value is greater than or equal to %(limit_value)s.
tr: Bu değerin %(limit_value)s'den büyük veya eşit olduğundan emin olun.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s سے زیادہ یا اس کے برابر ہے۔

source: Ensure this value is a multiple of step size %(limit_value)s.
tr: Bu değerin adım boyutu %(limit_value)s'nin bir katı olduğundan emin olun.
ur: یقینی بنائیں کہ یہ قدر مرحلے کے سائز %(limit_value)s کا ایک گنا ہے۔

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
tr: Bu değerin, %(offset)s'den başlayarak %(limit_value)s adım boyutunun bir katı olduğundan emin olun, örneğin: %(offset)s, %(valid_value1)s, %(valid_value2)s, vb.
ur: یقینی بنائیں کہ یہ قدر مرحلے کے سائز %(limit_value)s کا ایک گنا ہے، جس کی شروعات %(offset)s سے ہو، مثلاً %(offset)s، %(valid_value1)s، %(valid_value2)s، اور اسی طرح۔

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
tr: Bu değerin en az %(limit_value)d karakteri olduğundan emin olun (mevcut: %(show_value)d).
ur: یقینی بنائیں کہ اس قدر میں کم از کم %(limit_value)d حرف ہے (اس میں %(show_value)d ہے)۔

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
tr: Bu değerin en fazla %(limit_value)d karakteri olduğundan emin olun (mevcut: %(show_value)d).
ur: یقینی بنائیں کہ اس قدر میں زیادہ سے زیادہ %(limit_value)d حرف ہے (اس میں %(show_value)d ہے)۔

source: Enter a number.
tr: Bir sayı girin.
ur: ایک عدد درج کریں۔

source: Ensure that there are no more than %(max)s digit in total.
tr: Toplamda en fazla %(max)s rakam olduğundan emin olun.
ur: یقینی بنائیں کہ کل میں %(max)s سے زیادہ عدد نہیں ہے۔

source: Ensure that there are no more than %(max)s decimal place.
tr: En fazla %(max)s ondalık basamak olduğundan emin olun.
ur: یقینی بنائیں کہ اعشاریہ کے بعد %(max)s سے زیادہ جگہ نہیں ہے۔

source: Ensure that there are no more than %(max)s digit before the decimal point.
tr: Ondalık noktadan önce en fazla %(max)s rakam olduğundan emin olun.
ur: یقینی بنائیں کہ اعشاریہ سے پہلے %(max)s سے زیادہ عدد نہیں ہے۔

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
tr: “%(extension)s” dosya uzantısına izin verilmiyor. İzin verilen uzantılar: %(allowed_extensions)s.
ur: فائل کی توسیع “%(extension)s” کی اجازت نہیں ہے۔ اجازت یافتہ توسیع یہ ہیں: %(allowed_extensions)s۔

source: Null characters are not allowed.
tr: Null karakterlere izin verilmez.
ur: خالی حروف کی اجازت نہیں ہے۔

source: and
tr: ve
ur: اور

source: %(model_name)s with this %(field_labels)s already exists.
tr: Bu %(field_labels)s ile bir %(model_name)s zaten var.
ur: اس %(field_labels)s کے ساتھ %(model_name)s پہلے سے موجود ہے۔

source: Constraint “%(name)s” is violated.
tr: “%(name)s” kısıtlaması ihlal edildi.
ur: پابندی “%(name)s” کی خلاف ورزی کی گئی ہے۔

source: Value %(value)r is not a valid choice.
tr: %(value)r değeri geçerli bir seçenek değil.
ur: قدر %(value)r ایک درست انتخاب نہیں ہے۔

source: This field cannot be null.
tr: Bu alan boş olamaz.
ur: یہ فیلڈ خالی نہیں ہو سکتی۔

source: This field cannot be blank.
tr: Bu alan boş bırakılamaz.
ur: یہ فیلڈ خالی نہیں ہو سکتی۔

source: %(model_name)s with this %(field_label)s already exists.
tr: Bu %(field_label)s ile bir %(model_name)s zaten var.
ur: اس %(field_label)s کے ساتھ %(model_name)s پہلے سے موجود ہے۔

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
tr: %(field_label)s, %(date_field_label)s %(lookup_type)s için benzersiz olmalıdır.
ur: %(field_label)s کو %(date_field_label)s %(lookup_type)s کے لیے منفرد ہونا چاہیے۔

source: Field of type: %(field_type)s
tr: Alan tipi: %(field_type)s
ur: فیلڈ کی قسم: %(field_type)s

source: “%(value)s” value must be either True or False.
tr: “%(value)s” değeri True veya False olmalıdır.
ur: “%(value)s” کی قدر یا تو صحیح یا غلط ہونی چاہیے۔

source: “%(value)s” value must be either True, False, or None.
tr: “%(value)s” değeri True, False veya None olmalıdır.
ur: “%(value)s” کی قدر یا تو صحیح، غلط یا کوئی نہیں ہونی چاہیے۔

source: Boolean (Either True or False)
tr: Boolean (True veya False)
ur: بولین (یا تو صحیح یا غلط)

source: String (up to %(max_length)s)
tr: Dize (%(max_length)s karaktere kadar)
ur: سٹرنگ (زیادہ سے زیادہ %(max_length)s)

source: String (unlimited)
tr: Dize (sınırsız)
ur: سٹرنگ (لامحدود)

source: Comma-separated integers
tr: Virgülle ayrılmış tam sayılar
ur: کوما سے جدا شدہ صحیح اعداد

source: “%(value)s” value has an invalid date format. It must be inYYYY-MM-DD format.
tr: “%(value)s” değeri geçersiz bir tarih biçimine sahip. YYYY-AA-GG biçiminde olmalıdır.
ur: “%(value)s” کی قدر کی تاریخ کی شکل غلط ہے۔ یہ YYYY-MM-DD کی شکل میں ہونی چاہیے۔

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
tr: “%(value)s” değeri doğru biçimde (YYYY-AA-GG) ancak geçersiz bir tarihtir.
ur: “%(value)s” کی قدر کی شکل (YYYY-MM-DD) درست ہے لیکن یہ ایک غلط تاریخ ہے۔

source: Date (without time)
tr: Tarih (saatsiz)
ur: تاریخ (وقت کے بغیر)

source: “%(value)s” value has an invalid format. It must be inYYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
tr: “%(value)s” değeri geçersiz bir biçime sahip. YYYY-AA-GG HH:DD[:ss[.uuuuuu]][TZ] biçiminde olmalıdır.
ur: “%(value)s” کی قدر کی شکل غلط ہے۔ یہ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] کی شکل میں ہونی چاہیے۔

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
tr: “%(value)s” değeri doğru biçimde (YYYY-AA-GG HH:DD[:ss[.uuuuuu]][TZ]) ancak geçersiz bir tarih/saat bilgisidir.
ur: “%(value)s” کی قدر کی شکل (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) درست ہے لیکن یہ ایک غلط تاریخ/وقت ہے۔

source: Date (with time)
tr: Tarih (saatli)
ur: تاریخ (وقت کے ساتھ)

source: “%(value)s” value must be a decimal number.
tr: “%(value)s” değeri bir ondalık sayı olmalıdır.
ur: “%(value)s” کی قدر ایک اعشاریہ عدد ہونی چاہیے۔

source: Decimal number
tr: Ondalık sayı
ur: اعشاریہ عدد

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
tr: “%(value)s” değeri geçersiz bir biçime sahip. [GG] [[SS:]DD:]ss[.uuuuuu] biçiminde olmalıdır.
ur: “%(value)s” کی قدر کی شکل غلط ہے۔ یہ [DD] [[HH:]MM:]ss[.uuuuuu] کی شکل میں ہونی چاہیے۔

source: Duration
tr: Süre
ur: مدت

source: Email address
tr: E-posta adresi
ur: ای میل ایڈریس

source: File path
tr: Dosya yolu
ur: فائل کا راستہ

source: “%(value)s” value must be a float.
tr: “%(value)s” değeri bir ondalık sayı olmalıdır.
ur: “%(value)s” کی قدر فلوٹ ہونی چاہیے۔

source: Floating point number
tr: Ondalık noktalı sayı
ur: فلوٹنگ پوائنٹ عدد

source: “%(value)s” value must be an integer.
tr: “%(value)s” değeri bir tam sayı olmalıdır.
ur: “%(value)s” کی قدر صحیح عدد ہونی چاہیے۔

source: Integer
tr: Tam sayı
ur: صحیح عدد

source: Big (8 byte) integer
tr: Büyük (8 bayt) tam sayı
ur: بڑا (8 بائٹ) صحیح عدد

source: Small integer
tr: Küçük tam sayı
ur: چھوٹا صحیح عدد

source: IPv4 address
tr: IPv4 adresi
ur: IPv4 ایڈریس

source: IP address
tr: IP adresi
ur: IP ایڈریس

source: “%(value)s” value must be either None, True or False.
tr: “%(value)s” değeri None, True veya False olmalıdır.
ur: “%(value)s” کی قدر یا تو کوئی نہیں، صحیح یا غلط ہونی چاہیے۔

source: Boolean (Either True, False or None)
tr: Boolean (True, False veya None)
ur: بولین (یا تو صحیح، غلط یا کوئی نہیں)

source: Positive big integer
tr: Pozitif büyük tam sayı
ur: مثبت بڑا صحیح عدد

source: Positive integer
tr: Pozitif tam sayı
ur: مثبت صحیح عدد

source: Positive small integer
tr: Pozitif küçük tam sayı
ur: مثبت چھوٹا صحیح عدد

source: Slug (up to %(max_length)s)
tr: Slug (%(max_length)s karaktere kadar)
ur: سلوگ (زیادہ سے زیادہ %(max_length)s)

source: Text
tr: Metin
ur: متن

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
tr: “%(value)s” değeri geçersiz bir biçime sahip. SS:DD[:ss[.uuuuuu]] biçiminde olmalıdır.
ur: “%(value)s” کی قدر کی شکل غلط ہے۔ یہ HH:MM[:ss[.uuuuuu]] کی شکل میں ہونی چاہیے۔

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
tr: “%(value)s” değeri doğru biçimde (SS:DD[:ss[.uuuuuu]]) ancak geçersiz bir saat bilgisidir.
ur: “%(value)s” کی قدر کی شکل (HH:MM[:ss[.uuuuuu]]) درست ہے لیکن یہ ایک غلط وقت ہے۔

source: Time
tr: Saat
ur: وقت

source: Raw binary data
tr: Ham ikili veri
ur: خام بائنری ڈیٹا

source: “%(value)s” is not a valid UUID.
tr: “%(value)s” geçerli bir UUID değil.
ur: “%(value)s” ایک درست UUID نہیں ہے۔

source: Universally unique identifier
tr: Evrensel benzersiz tanımlayıcı
ur: عالمگیر منفرد شناخت کنندہ

source: File
tr: Dosya
ur: فائل

source: Image
tr: Resim
ur: تصویر

source: A JSON object
tr: Bir JSON nesnesi
ur: ایک JSON آبجیکٹ

source: Value must be valid JSON.
tr: Değer geçerli bir JSON olmalıdır.
ur: قدر درست JSON ہونی چاہیے۔

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
tr: %(field)s %(value)r değerine sahip %(model)s örneği geçerli bir seçenek değil.
ur: %(field)s %(value)r کے ساتھ %(model)s کا انسٹنس ایک درست انتخاب نہیں ہے۔

source: Foreign Key (type determined by related field)
tr: Yabancı Anahtar (türü ilgili alan tarafından belirlenir)
ur: فارن کی (متعلقہ فیلڈ کے ذریعے قسم کا تعین کیا جاتا ہے)

source: One-to-one relationship
tr: Birebir ilişki
ur: ایک سے ایک تعلق

source: %(from)s-%(to)s relationship
tr: %(from)s-%(to)s ilişkisi
ur: %(from)s-%(to)s تعلق

source: %(from)s-%(to)s relationships
tr: %(from)s-%(to)s ilişkileri
ur: %(from)s-%(to)s تعلقات

source: Many-to-many relationship
tr: Çoka çok ilişki
ur: بہت سے بہت تعلق

source: This field is required.
tr: Bu alan zorunludur.
ur: یہ فیلڈ درکار ہے۔

source: Enter a whole number.
tr: Tam sayı girin.
ur: ایک پورا عدد درج کریں۔

source: Enter a valid date.
tr: Geçerli bir tarih girin.
ur: ایک درست تاریخ درج کریں۔

source: Enter a valid time.
tr: Geçerli bir saat girin.
ur: ایک درست وقت درج کریں۔

source: Enter a valid date/time.
tr: Geçerli bir tarih/saat girin.
ur: ایک درست تاریخ/وقت درج کریں۔

source: Enter a valid duration.
tr: Geçerli bir süre girin.
ur: ایک درست مدت درج کریں۔

source: The number of days must be between {min_days} and {max_days}.
tr: Gün sayısı {min_days} ile {max_days} arasında olmalıdır.
ur: دنوں کی تعداد {min_days} اور {max_days} کے درمیان ہونی چاہیے۔

source: No file was submitted. Check the encoding type on the form.
tr: Hiçbir dosya gönderilmedi. Formdaki kodlama türünü kontrol edin.
ur: کوئی فائل جمع نہیں کی گئی۔ فارم پر انکوڈنگ کی قسم چیک کریں۔

source: No file was submitted.
tr: Hiçbir dosya gönderilmedi.
ur: کوئی فائل جمع نہیں کی گئی۔

source: The submitted file is empty.
tr: Gönderilen dosya boş.
ur: جمع کی گئی فائل خالی ہے۔

source: Ensure this filename has at most %(max)d character (it has %(length)d).
tr: Bu dosya adının en fazla %(max)d karaktere sahip olduğundan emin olun (mevcut: %(length)d).
ur: یقینی بنائیں کہ اس فائل کے نام میں زیادہ سے زیادہ %(max)d حرف ہے (اس میں %(length)d ہے)۔
